Autodesk.Revit.DB.Analysis.Polyloop
A Polyloop represent a planar polygon with ordered points.
Remarks:
This class corresponds to IfcPolyLoop (see definition below).
Definition from ISO/CD 10303-42:1992: An IfcPolyLoop is a loop with straight
edges bounding a planar region in space. An IfcPolyLoop is a loop of genus 1
where the loop is represented by an ordered coplanar collection of points
forming the vertices of the loop. The loop is composed of straight line segments
joining a point in the collection to the succeeding point in the collection.
The closing segment is from the last to the first point in the collection.
The direction of the loop is in the direction of the line segments.
All the points in the polygon defining the poly loop shall be coplanar.
Since:
2012